Documents/ЗапросНаВыпискуИзЕГРЮЛ_ЕГРИП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ЗапросНаВыпискуИзЕГРЮЛ_ЕГРИП</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрЗапроса</Name>
					<Comment>Идентификационный номер налогоплательщика или основной государственный регистрационный номер</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПараметраЗапроса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПараметровЗапросаНаВыпискуИзЕГРЮЛ_ЕГРИП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ВидыПараметровЗапросаНаВыпискуИзЕГРЮЛ_ЕГРИП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВидыПараметровЗапросаНаВыпискуИзЕГРЮЛ_ЕГРИП</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ИНН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОГРН</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЗапросНаВыпискуИзЕГРЮЛ_ЕГРИП/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(СообщениеОснование)
	
	Если РегламентированнаяОтчетностьВызовСервера.ИспользуетсяОднаОрганизация() Тогда
		Модуль = ОбщегоНазначения.ОбщийМодуль("Справочники.Организации");
        Организация = Модуль.ОрганизацияПоУмолчанию();
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ДлинаСтрокиИНН_ОГРН = СтрДлина(СокрЛП(ПараметрЗапроса));
	
	Если ДлинаСтрокиИНН_ОГРН = 13 ИЛИ ДлинаСтрокиИНН_ОГРН = 15 Тогда
		ТекстСообщения = "";
		Если Не РегламентированныеДанныеКлиентСервер.ОГРНСоответствуетТребованиям(ПараметрЗапроса, ?(ДлинаСтрокиИНН_ОГРН = 13, Истина, Ложь), ТекстСообщения) Тогда
			ОбщегоНазначения.СообщитьПользователю(
				ТекстСообщения,, "ПредставлениеЗапроса", "", Отказ);
		КонецЕсли;
	ИначеЕсли ДлинаСтрокиИНН_ОГРН = 10 ИЛИ ДлинаСтрокиИНН_ОГРН = 12 Тогда
		ТекстСообщения = "";
		Если Не РегламентированныеДанныеКлиентСервер.ИННСоответствуетТребованиям(ПараметрЗапроса, ?(ДлинаСтрокиИНН_ОГРН = 10, Истина, Ложь), ТекстСообщения) Тогда
			ТекстСообщения = ТекстСообщения + " " + НСтр("ru = 'Данный ИНН не существует.'");
			ОбщегоНазначения.СообщитьПользователю(
				ТекстСообщения,, "ПредставлениеЗапроса", "", Отказ);
		КонецЕсли;
	Иначе
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Укажите верные параметры поиска ИНН или ОГРН.'"),, "ПредставлениеЗапроса", "", Отказ);
	КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ДлинаСтрокиИНН_ОГРН = СтрДлина(СтрЗаменить(ПараметрЗапроса, " ", ""));
	
	Если ДлинаСтрокиИНН_ОГРН = 13 ИЛИ ДлинаСтрокиИНН_ОГРН = 15 Тогда
		ВидПараметраЗапроса = Перечисления.ВидыПараметровЗапросаНаВыпискуИзЕГРЮЛ_ЕГРИП.ОГРН;
	ИначеЕсли ДлинаСтрокиИНН_ОГРН = 10 ИЛИ ДлинаСтрокиИНН_ОГРН = 12 Тогда
		ВидПараметраЗапроса = Перечисления.ВидыПараметровЗапросаНаВыпискуИзЕГРЮЛ_ЕГРИП.ИНН;
	Иначе
		ВидПараметраЗапроса = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
